# StairstypeCalcRuleMaxResult Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeCalcRuleMaxResult Property
ParameterTypeId Class See Also
---
"Max. Result": Calculation Rule Max Result
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeCalcRuleMaxResult { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeCalcRuleMaxResult As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeCalcRuleMaxResult {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace